// stations.js — พิกัดสถานี (โดยประมาณ — แก้เป็นพิกัดจริงจาก TWQMS ได้ที่นี่)
// zone: east=เจ้าพระยา west=แม่กลอง src=ต้นทาง
const STATIONS = [
 {
  "name": "โรงเรียนเตรียมอุดมศึกษาน้อมเกล้",
  "lat": 13.79,
  "lon": 100.68,
  "zone": "east"
 },
 {
  "name": "โรงเรียนทหารขนส่ง กรมการขนส่งทห",
  "lat": 13.85,
  "lon": 100.58,
  "zone": "east"
 },
 {
  "name": "กองพันทหารสื่อสาร กองบัญชาการกอ",
  "lat": 13.84,
  "lon": 100.57,
  "zone": "east"
 },
 {
  "name": "โรงพยาบาลภูมิพลอดุลยเดช",
  "lat": 13.92,
  "lon": 100.62,
  "zone": "east"
 },
 {
  "name": "โรงพยาบาลซีจีเอช สายไหม",
  "lat": 13.91,
  "lon": 100.65,
  "zone": "east"
 },
 {
  "name": "พระราชวังดุสิต สวนจิตรลดา",
  "lat": 13.77,
  "lon": 100.52,
  "zone": "east"
 },
 {
  "name": "โรงพยาบาลศิริราช",
  "lat": 13.76,
  "lon": 100.48,
  "zone": "east"
 },
 {
  "name": "บริษัท โอสถสภา จำกัด (มหาชน)",
  "lat": 13.82,
  "lon": 100.58,
  "zone": "east"
 },
 {
  "name": "สถานคุ้มครองและพัฒนาอาชีพบ้านเก",
  "lat": 13.9,
  "lon": 100.5,
  "zone": "east"
 },
 {
  "name": "ศูนย์วิทยาศาสตร์เพื่อการศึกษาแห",
  "lat": 13.75,
  "lon": 100.59,
  "zone": "east"
 },
 {
  "name": "บริษัท ศิครินทร์ จำกัด (มหาชน)",
  "lat": 13.71,
  "lon": 100.61,
  "zone": "east"
 },
 {
  "name": "โรงเรียนหาดอมราอักษรลักษณ์วิทยา",
  "lat": 13.6,
  "lon": 100.61,
  "zone": "east"
 },
 {
  "name": "บริษัท เอจีซี แฟลทกลาส (ประเทศไ",
  "lat": 13.55,
  "lon": 100.63,
  "zone": "east"
 },
 {
  "name": "โรงไฟฟ้าพระนครใต้",
  "lat": 13.63,
  "lon": 100.57,
  "zone": "east"
 },
 {
  "name": "บริษัท มหาจักรออโตพาร์ท จำกัด",
  "lat": 13.79,
  "lon": 100.7,
  "zone": "east"
 },
 {
  "name": "นิคมอุตสาหกรรมบางชัน",
  "lat": 13.83,
  "lon": 100.7,
  "zone": "east"
 },
 {
  "name": "ศูนย์ไตเทียมเทียนฟ้าประชาการุณย",
  "lat": 13.74,
  "lon": 100.51,
  "zone": "east"
 },
 {
  "name": "นิคมอุตสาหกรรมลาดกระบัง",
  "lat": 13.72,
  "lon": 100.79,
  "zone": "east"
 },
 {
  "name": "บริษัท ท่าอากาศยานไทย มหาชน จำก",
  "lat": 13.69,
  "lon": 100.75,
  "zone": "east"
 },
 {
  "name": "มหาวิทยาลัยหัวเฉียวเฉลิมพระเกีย",
  "lat": 13.56,
  "lon": 100.68,
  "zone": "east"
 },
 {
  "name": "นิคมอุตสาหกรรมบางพลี",
  "lat": 13.58,
  "lon": 100.72,
  "zone": "east"
 },
 {
  "name": "สถานีตำรวจภูธรคลองด่าน",
  "lat": 13.52,
  "lon": 100.75,
  "zone": "east"
 },
 {
  "name": "นิคมอุตสาหกรรมบางปู",
  "lat": 13.53,
  "lon": 100.65,
  "zone": "east"
 },
 {
  "name": "ศูนย์พัฒนาการจัดสวัสดิการสังคมผ",
  "lat": 13.7,
  "lon": 100.42,
  "zone": "west"
 },
 {
  "name": "ศูนย์กีฬาเฉลิมพระเกียรติ",
  "lat": 13.69,
  "lon": 100.46,
  "zone": "west"
 },
 {
  "name": "ม.เทคโนโลยีพระจอมเกล้าธนบุรี (ว",
  "lat": 13.65,
  "lon": 100.49,
  "zone": "west"
 },
 {
  "name": "มหาวิทยาลัยเอเชียอาคเนย์",
  "lat": 13.7,
  "lon": 100.43,
  "zone": "west"
 },
 {
  "name": "เรือนจำพิเศษธนบุรี",
  "lat": 13.71,
  "lon": 100.47,
  "zone": "west"
 },
 {
  "name": "โรงเรียนบดินทรเดชา (สิงห์ สิงหเ",
  "lat": 13.87,
  "lon": 100.44,
  "zone": "west"
 },
 {
  "name": "โรงเรียนราชวินิต นนทบุรี",
  "lat": 13.88,
  "lon": 100.45,
  "zone": "west"
 },
 {
  "name": "สถานีตำรวจภูธรไทรน้อย",
  "lat": 13.96,
  "lon": 100.38,
  "zone": "west"
 },
 {
  "name": "โรงเรียนตั้งพิรุฬห์ธรรม",
  "lat": 13.9,
  "lon": 100.43,
  "zone": "west"
 },
 {
  "name": "สำนักงานประปาสาขานนทบุรี",
  "lat": 13.86,
  "lon": 100.51,
  "zone": "east"
 },
 {
  "name": "สำนักงานประปาสาขาทุ่งมหาเมฆ",
  "lat": 13.72,
  "lon": 100.54,
  "zone": "east"
 },
 {
  "name": "สำนักงานประปาสาขาสุขุมวิท-พระโข",
  "lat": 13.68,
  "lon": 100.6,
  "zone": "east"
 },
 {
  "name": "สำนักงานประปาสาขาสมุทรปราการ",
  "lat": 13.6,
  "lon": 100.59,
  "zone": "east"
 },
 {
  "name": "สำนักงานประปาสาขามีนบุรี",
  "lat": 13.81,
  "lon": 100.72,
  "zone": "east"
 },
 {
  "name": "สำนักงานประปาสาขาบางบัวทอง",
  "lat": 13.91,
  "lon": 100.42,
  "zone": "west"
 },
 {
  "name": "สถานีสูบส่งน้ำบางเขน 1 (TR1)",
  "lat": 13.87,
  "lon": 100.6,
  "zone": "src"
 },
 {
  "name": "สถานีสูบส่งน้ำบางเขน 2 (TR2)",
  "lat": 13.88,
  "lon": 100.61,
  "zone": "src"
 },
 {
  "name": "สถานีสูบส่งน้ำบางเขน 3 (TR3)",
  "lat": 13.86,
  "lon": 100.62,
  "zone": "src"
 },
 {
  "name": "สถานีสูบจ่ายน้ำบางเขน 1 (Dis1)",
  "lat": 13.85,
  "lon": 100.6,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำบางเขน 2 (Dis2)",
  "lat": 13.89,
  "lon": 100.63,
  "zone": "east"
 },
 {
  "name": "โรงงานผลิตน้ำธนบุรี",
  "lat": 13.72,
  "lon": 100.47,
  "zone": "src"
 },
 {
  "name": "โรงงานผลิตน้ำสามเสน 1",
  "lat": 13.79,
  "lon": 100.51,
  "zone": "src"
 },
 {
  "name": "โรงงานผลิตน้ำสามเสน 2",
  "lat": 13.79,
  "lon": 100.52,
  "zone": "src"
 },
 {
  "name": "โรงงานผลิตน้ำสามเสน 3",
  "lat": 13.8,
  "lon": 100.51,
  "zone": "src"
 },
 {
  "name": "โรงงานผลิตน้ำสามเสน 4",
  "lat": 13.8,
  "lon": 100.52,
  "zone": "src"
 },
 {
  "name": "สถานีสูบส่งน้ำมหาสวัสดิ์",
  "lat": 13.78,
  "lon": 100.4,
  "zone": "src"
 },
 {
  "name": "สถานีสูบจ่ายน้ำมหาสวัสดิ์",
  "lat": 13.79,
  "lon": 100.41,
  "zone": "src"
 },
 {
  "name": "สถานีสูบจ่ายน้ำลุมพินี",
  "lat": 13.73,
  "lon": 100.54,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำลาดพร้าว",
  "lat": 13.8,
  "lon": 100.6,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำคลองเตย",
  "lat": 13.71,
  "lon": 100.58,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำสำโรง",
  "lat": 13.63,
  "lon": 100.6,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำมีนบุรี",
  "lat": 13.81,
  "lon": 100.73,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำลาดกระบัง",
  "lat": 13.72,
  "lon": 100.78,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำบางพลี",
  "lat": 13.6,
  "lon": 100.71,
  "zone": "east"
 },
 {
  "name": "สถานีสูบจ่ายน้ำราษฎร์บูรณะ",
  "lat": 13.68,
  "lon": 100.51,
  "zone": "west"
 },
 {
  "name": "สถานีสูบจ่ายน้ำเพชรเกษม",
  "lat": 13.71,
  "lon": 100.44,
  "zone": "west"
 },
 {
  "name": "สถานีสูบจ่ายน้ำท่าพระ",
  "lat": 13.72,
  "lon": 100.48,
  "zone": "west"
 },
 {
  "name": "สถานีสูบจ่ายน้ำพหลโยธิน",
  "lat": 13.83,
  "lon": 100.56,
  "zone": "east"
 }
];
